# Квадрат полибия
#   1 2 3 4 5 6
# 1 А Б В Г Д Е
# 2 Ж З И Й К Л
# 3 М Н О П Р С
# 4 Т У Ф Х Ц Ч
# 5 Ш Щ Ъ Ы Ь Э
# 6 Ю Я
#
###

text = "КАЖДАЯКЛАДКАДОЛЖНАСТОЯТЬНАСОБСТВЕННОМДНИЩЕТЧК" # СЮДА ПИШЕМ НАШУ ФРАЗУ

keys = {
    'А': '11', 'Б': '12', 'В': '13', 'Г': '14', 'Д': '15', 'Е': '16',
    'Ж': '21', 'З': '22', 'И': '23', 'й': '24', 'К': '25', 'Л': '26',
    'М': '31', 'Н': '32', 'О': '33', 'П': '34', 'Р': '35', 'С': '36',
    'Т': '41', 'У': '42', 'Ф': '43', 'Х': '44', 'Ц': '45', 'Ч': '46',
    'Ш': '51', 'Щ': '52', 'Ъ': '53', 'Ы': '54', 'Ь': '55', 'Э': '56',
    'Ю': '61', 'Я': '62',
}                                                       # ДАЕМ ЦИФРОВОЕ ОБОЗНАЧЕНИЕ КАЖДОЙ БУКВЕ В СООТВЕТСВИИ КВАДРАТУ ПОЛИБИЯ


# Шифрование

encrypt = ""
for i in text:
    if i in keys:
        encrypt += keys[i]
        encrypt += ' '
print(encrypt)


# Расшифрование

temp = ''
decrypt = ''

for i in encrypt:
    if i != " ":
        temp += i
    else:
        for j in keys:
            if keys[j] == temp:
                decrypt += j
        temp = ""

print(decrypt)


